ExprovipFuel/src/DataProcessors/ОбменССайтом/ОбменССайтом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбменССайтом</name>
</mdclass:DataProcessor>

ExprovipFuel/src/Documents/Фактура/Фактура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Фактура</name>
  <registerRecords>AccumulationRegister.ОборотыТоплива</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоставщики</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыКлиенты</registerRecords>
  <attributes>
    <name>ПоследнийНомерПечати</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>флагСчитатьСкидкуОтМестаТранзакции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаДороги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсЗаДороги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор77</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикДороги</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Транзакции</name>
    <attributes>
      <name>ДатаТранзакции</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Карта</name>
      <type>
        <types>CatalogRef.Карточки</types>
      </type>
    </attributes>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Автомобиль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоТранзакции</name>
      <type>
        <types>CatalogRef.МестаТранзакции</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСоСкидкой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Итого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Надбавка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяЦенаСНадбавкой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.ФактураШаблон</types>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаПоставщика</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ФлагНеУчитывать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПримененнаяСкидка</name>
      <type>
        <types>EnumRef.ВидСкидки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ExprovipFuel/src/DataProcessors/ОбменССайтом/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выгрузить транзакции.
// 
// Параметры:
//  НачалоПериода - Дата
//  КонецПериода - Дата
Процедура ВыгрузитьТранзакции(НачалоПериода, КонецПериода) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Фактура.Ссылка КАК Фактура
	|ИЗ
	|	Документ.Фактура КАК Фактура
	|ГДЕ
	|	Фактура.Проведен
	|	И Фактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	
	МассивФактур = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Фактура");
	
	JSON = Exprovip.МассивТранзакцийФактуре(МассивФактур);
	
	Настройки = Справочники.Настройки.ПолучитьНастройки();
	
	Если ПустаяСтрока(Настройки.ПутьВыгрузкиДляСайта) Тогда
		ВызватьИсключение(СтрШаблон("Не задан значения для: %1", "Путь выгрузки для сайта"));
	КонецЕсли;
	ИмяФайлаВыгрузки = Exprovip.СформироватьИмяФайлаПоПути(Настройки.ПутьВыгрузкиДляСайта, "transactions", "json");		
	ТекстовыйДокумент = Новый ТекстовыйДокумент();
	ТекстовыйДокумент.УстановитьТекст(JSON);
	ТекстовыйДокумент.Записать(ИмяФайлаВыгрузки);
	
КонецПроцедуры

// Выгрузить фактуры.
// 
// Параметры:
//  НачалоПериода - Дата
//  КонецПериода - Дата
Процедура ВыгрузитьФактуры(НачалоПериода, КонецПериода) Экспорт
	МассивСтруктур = Новый Массив(); //Массив из См. ШаблонСтруктурыФактурыДляПечати()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Фактура.Ссылка КАК Фактура
	|ИЗ
	|	Документ.Фактура КАК Фактура
	|ГДЕ
	|	Фактура.Проведен
	|	И Фактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТаблицаПечати = ТаблицаПечатиШаблон();
		ТаблицаДанные = ТаблицаДанныеШаблон();

		ФактураОбъект = Выборка.Фактура.ПолучитьОбъект();
		СтруктураПечати = Документы.Фактура.ПолучитьСтруктуруПечати(ФактураОбъект);

		Документы.Фактура.ЗаполнитьТаблицуПечати(СтруктураПечати, ТаблицаПечати);
		Документы.Фактура.ЗаполнитьТаблицаДанные(СтруктураПечати, ТаблицаДанные);
		
		Счетчик = 0;
		
		Для Каждого СтрокаТЧ Из ТаблицаПечати Цикл
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("pdf");
			
			Счетчик = Счетчик + 1;
			Если Счетчик >= 2 Тогда
				Прервать;
			КонецЕсли;	
			
			//@skip-check query-in-loop
			Структура = ПолучитьТабличныйДокумент(
				СтрокаТЧ.Контрагент,
				СтрокаТЧ.ЭтапОплаты,
				СтрокаТЧ.НомерФактуры,
				ТаблицаДанные,
				Выборка.Фактура);
			ТабличныйДокумент = Структура.ТабличныйДокумент;
			ТабличныйДокумент.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
			
			ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
						
			СтруктураТекущейФактуры = ШаблонСтруктурыФактурыДляПечати();
			СтруктураТекущейФактуры.Number = Структура.НомерФактуры;
			СтруктураТекущейФактуры.Date = Структура.ДатаФактуры;
			СтруктураТекущейФактуры.Currency = СокрЛП(Структура.ВалютаФактуры);
			СтруктураТекущейФактуры.Amount = Структура.СуммаФактуры;
			СтруктураТекущейФактуры.Metadata = Base64Строка(ДвоичныеДанные);
			
			МассивСтруктур.Добавить(СтруктураТекущейФактуры);
			
		КонецЦикла;		
	КонецЦикла;	
	
	Если МассивСтруктур.Количество() > 0 Тогда
		JSON = Exprovip.СериализоватьJSON(МассивСтруктур);
	
		Настройки = Справочники.Настройки.ПолучитьНастройки();
		
		Если ПустаяСтрока(Настройки.ПутьВыгрузкиДляСайта) Тогда
			ВызватьИсключение(СтрШаблон("Не задан значения для: %1", "Путь выгрузки для сайта"));
		КонецЕсли;
		ИмяФайлаВыгрузки = Exprovip.СформироватьИмяФайлаПоПути(Настройки.ПутьВыгрузкиДляСайта, "invoices", "json");		
		ТекстовыйДокумент = Новый ТекстовыйДокумент();
		ТекстовыйДокумент.УстановитьТекст(JSON);
		ТекстовыйДокумент.Записать(ИмяФайлаВыгрузки);	
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Отсутсвуют фактуры для передачи на сайт");
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Таблица печати шаблон.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица печати шаблон:
// * Выбран - Булево - 
// * Контрагент - СправочникСсылка.Контрагенты - 
// * НомерФактуры - Число - 
// * ЭтапОплаты - Число - 
Функция ТаблицаПечатиШаблон()
	ТаблицаПечати = Новый ТаблицаЗначений();
	ТаблицаПечати.Колонки.Добавить("Выбран", Новый ОписаниеТипов("Булево"));
	ТаблицаПечати.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаПечати.Колонки.Добавить("НомерФактуры", Новый ОписаниеТипов("Число"));
	ТаблицаПечати.Колонки.Добавить("ЭтапОплаты", Новый ОписаниеТипов("Число"));
	
	Возврат ТаблицаПечати;
КонецФункции

// Таблица данные шаблон.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица данные шаблон:
// * ДатаТранзакции - Дата - 
// * Карта - СправочникСсылка.Карточки - 
// * Клиент - СправочникСсылка.Контрагенты - 
// * Автомобиль - Строка - 
// * МестоТранзакции - СправочникСсылка.МестаТранзакции - 
// * Продукт - СправочникСсылка.Номенклатура - 
// * Количество - Число - 
// * Цена - Число - 
// * Сумма - Число - 
// * Итого - Число - 
// * СуммаСкидки - Число - 
// * ЭтапОплаты - Число - 
// * Валюта - СправочникСсылка.Валюты - 
// * Скидка - Число - 
// * ЦенаСоСкидкой - Число - 
Функция ТаблицаДанныеШаблон()
	ТаблицаДанные = Новый ТаблицаЗначений();
	ТаблицаДанные.Колонки.Добавить("ДатаТранзакции", Новый ОписаниеТипов("Дата"));
	ТаблицаДанные.Колонки.Добавить("Карта", Новый ОписаниеТипов("СправочникСсылка.Карточки"));
	ТаблицаДанные.Колонки.Добавить("Клиент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаДанные.Колонки.Добавить("Автомобиль", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(100)));
	ТаблицаДанные.Колонки.Добавить("МестоТранзакции", Новый ОписаниеТипов("СправочникСсылка.МестаТранзакции"));
	ТаблицаДанные.Колонки.Добавить("Продукт", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДанные.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ТаблицаДанные.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	ТаблицаДанные.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ТаблицаДанные.Колонки.Добавить("Итого", Новый ОписаниеТипов("Число"));
	ТаблицаДанные.Колонки.Добавить("СуммаСкидки", Новый ОписаниеТипов("Число"));
	ТаблицаДанные.Колонки.Добавить("ЭтапОплаты", Новый ОписаниеТипов("Число"));
	ТаблицаДанные.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаДанные.Колонки.Добавить("Скидка", Новый ОписаниеТипов("Число"));
	ТаблицаДанные.Колонки.Добавить("ЦенаСоСкидкой", Новый ОписаниеТипов("Число"));
	
	Возврат ТаблицаДанные;
КонецФункции

// Получить табличный документ.
// 
// Параметры:
//  КонтрагентСсылка - СправочникСсылка.Контрагенты - Контрагент ссылка
//  ЭтапОплаты - Число - Этап оплаты
//  НомерФактуры - Число - Номер фактуры
//  ТаблицаДанные - ТаблицаЗначений - Таблица данные:
// * ДатаТранзакции - Дата - 
// * Карта - СправочникСсылка.Карточки - 
// * Клиент - СправочникСсылка.Контрагенты - 
// * Автомобиль - Строка - 
// * МестоТранзакции - СправочникСсылка.МестаТранзакции - 
// * Продукт - СправочникСсылка.Номенклатура - 
// * Количество - Число - 
// * Цена - Число - 
// * Сумма - Число - 
// * Итого - Число - 
// * СуммаСкидки - Число - 
// * ЭтапОплаты - Число - 
// * Валюта - СправочникСсылка.Валюты - 
// * Скидка - Число - 
// * ЦенаСоСкидкой - Число - 
//  ФактураСсылка - ДокументСсылка.Фактура
// 
// Возвращаемое значение:
//  Структура - Получить табличный документ:
// * ТабличныйДокумент - ТабличныйДокумент - 
// * ИмяФайла - Строка - 
// * НомерФактуры - Строка - 
// * ДатаФактуры - Дата - 
Функция ПолучитьТабличныйДокумент(КонтрагентСсылка, ЭтапОплаты, НомерФактуры, ТаблицаДанные, ФактураСсылка)
	ТаблицаДанныеВременная = ТаблицаДанные;
	
	Возврат Документы.Фактура.СтруктураФактурыКлиента(
		КонтрагентСсылка,
		ЭтапОплаты,
		НомерФактуры,
		ФактураСсылка,
		ТаблицаДанныеВременная);
КонецФункции

// Шаблон структуры фактуры для печати.
// 
// Возвращаемое значение:
//  Структура - Шаблон структуры фактуры для печати:
// * Date - Строка - 
// * Number - Строка - 
// * Currency - Строка - 
// * Amount - Строка - 
// * Metadata - Строка - 
Функция ШаблонСтруктурыФактурыДляПечати()
	Структура = Новый Структура();
	Структура.Вставить("Date", "");
	Структура.Вставить("Number", "");
	Структура.Вставить("Currency", "");
	Структура.Вставить("Amount", "");
	Структура.Вставить("Metadata", "");
	
	Возврат Структура;
КонецФункции	
	
#КонецОбласти

#КонецЕсли
